Actualizando vulnerabilidades, embebiendo diagramas, actualizando el docx
